app/controllers/api_controller.rb

INSERT INTO "accesses" ("visitor_cookie", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["visitor_cookie", "frfrgg"], ["url", "/drt/sc"], ["created_at", "2017-08-20 06:00:55.099051"], ["updated_at", "2017-08-20 06:00:55.099051"]]
---
  def insert_access
    if params[:visitor_cookie].present? and params[:url].present?
      Access.create(:visitor_cookie => params[:visitor_cookie], :url => params[:url])

INSERT INTO "contacts" ("email", "visitor_cookie", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "st@mail.com"], ["visitor_cookie", "frfrgg"], ["created_at", "2017-08-20 06:02:46.899230"], ["updated_at", "2017-08-20 06:02:46.899230"]]
---
  def insert_contact
    if params[:email].present? and params[:visitor_cookie].present?
      Contact.create_contact(params[:email], params[:visitor_cookie])