app/controllers/contacts_controller.rb

  def show
    @contact = Contact.find_by_id(params[:id])
    if @contact
      @accesses = Access.where(visitor_cookie: @contact.contact_identifications.map(&:visitor_cookie))
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "accesses".* FROM "accesses" WHERE "accesses"."visitor_cookie" = ? LIMIT ?  [["visitor_cookie", "frfrgg"], ["LIMIT", 1]]